---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Macros.DocumentEntryPoint
source: html/cbeef9b7-78da-9bb9-00f9-75fd3bfde3e1.htm
---
# DocumentEntryPoint Members

Initializes a new instance of the DocumentEntryPoint class